[
    {
        "Name": "batch_size_grokking",
        "Title": "Batch Size Grokking: Assessing the impact of the training batchsize on the grokking phenomenon",
        "Experiment": "Modify the experiments to dynamically adjust the batch size during training, starting with a small batch size and gradually increasing it. This could potentially lead to faster generalization on the validation set.",
        "Interestingness": 6,
        "Feasibility": 4,
        "Novelty": 4,
        "novel": false
    },
    {
        "Name": "architecture_capacity_grokking",
        "Title": "The Role of Model Capacity in Grokking: A Systematic Study of Transformer Architecture Parameters",
        "Experiment": "Implement focused grid search over architectural parameters: layers [1,2,4], dimensions [64,128,256], heads [2,4,8]. Group models into three capacity buckets (small/medium/large) based on parameter count. For each capacity bucket, compare deep-narrow vs wide-shallow architectures. Track core metrics: steps to memorization (>99% train accuracy), steps to grokking (>99% validation accuracy), and stability of generalization post-grokking. Create visualizations comparing learning trajectories within each capacity bucket. Run 5 seeds per configuration for statistical reliability.",
        "Interestingness": 9,
        "Feasibility": 8,
        "Novelty": 8,
        "novel": true
    },
    {
        "Name": "task_complexity_spectrum",
        "Title": "Quantifying the Relationship Between Task Complexity and Grokking Dynamics",
        "Experiment": "1. Implement HierarchicalComplexityDataset with discrete complexity levels (0-3) based on pattern structure. 2. Add task-specific complexity metrics (pattern count, cycle complexity, I/O entropy). 3. Create controlled task variants: a) Pure operations, b) Single-pattern exceptions, c) Multi-pattern exceptions, d) Random exceptions. 4. Track additional metrics: output distribution entropy, learning rate dynamics, memorization/grokking phase lengths. 5. Run experiments across all complexity levels and operations. 6. Analyze relationship between complexity metrics and grokking dynamics, including model confidence and learning phase characteristics.",
        "Interestingness": 9,
        "Feasibility": 9,
        "Novelty": 9,
        "novel": true
    }
]